// NORMAL MAZE
Breakpoint 1, main () at ExploreTheRegularLabyrinth.cpp:19
19      if (isPathToFreedom(start, kPathOutOfRegularMaze)) {
(gdb) i locals
m = {_vptr.Maze = 0x555555763bf8 <vtable for Maze+16>, grid = {
    _vptr.Grid = 0x555555763c18 <vtable for Grid<MazeCell*>+16>, NumRows = 4,
    Rows = 0x555555776f10}, numRows = 4, numCols = 4, kNumTwistyRooms = 12}
start = 0x555555777620
(gdb) p* start
$1 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555777670,
  west = 0x0}
(gdb) p *(start->east)
$2 = {whatsHere = "", north = 0x0, south = 0x5555557777b0,
  east = 0x5555557776c0, west = 0x555555777620}
(gdb) p *(start->east->east)
$3 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555777710,
  west = 0x555555777670}
(gdb) p *(start->east->east->east)
$4 = {whatsHere = "Spellbook", north = 0x0, south = 0x0, east = 0x0,
  west = 0x5555557776c0}
(gdb) p*(start->east->south)
$5 = {whatsHere = "", north = 0x555555777670, south = 0x5555557778f0,
  east = 0x0, west = 0x0}
(gdb) p*(start->east->south->south)
$6 = {whatsHere = "", north = 0x5555557777b0, south = 0x555555777a30,
  east = 0x0, west = 0x5555557778a0}
(gdb) p*(start->east->south->south->south)
$7 = {whatsHere = "", north = 0x5555557778f0, south = 0x0,
  east = 0x555555777a80, west = 0x0}
(gdb) p*(start->east->south->south->south->east)
$8 = {whatsHere = "", north = 0x555555777940, south = 0x0, east = 0x0,
  west = 0x555555777a30}
(gdb) p*(start->east->south->south->south->east->north)
$9 = {whatsHere = "", north = 0x555555777800, south = 0x555555777a80,
  east = 0x555555777990, west = 0x0}
(gdb) p*(start->east->south->south->south->east->north->north)
$10 = {whatsHere = "Wand", north = 0x0, south = 0x555555777940, east = 0x0,
  west = 0x0}
(gdb) p*(start->east->south->south->south->east->north->east)
$11 = {whatsHere = "", north = 0x555555777850, south = 0x555555777ad0,
  east = 0x0, west = 0x555555777940}
(gdb) p*(start->east->south->south->south->east->north->east->north)
$12 = {whatsHere = "", north = 0x0, south = 0x555555777990, east = 0x0,
  west = 0x0}
(gdb) p*(start->east->south->south->south->east->north->east->south)
$13 = {whatsHere = "", north = 0x555555777990, south = 0x0, east = 0x0,
  west = 0x0}
(gdb) p* (start->east->south->south->east)
Cannot access memory at address 0x0
(gdb) p* (start->east->south->south->west)
$14 = {whatsHere = "", north = 0x555555777760, south = 0x5555557779e0,
  east = 0x5555557778f0, west = 0x0}
(gdb) p* (start->east->south->south->west->south)
$15 = {whatsHere = "", north = 0x5555557778a0, south = 0x0, east = 0x0,
  west = 0x0}
(gdb) p* (start->east->south->south->west->north)
$16 = {whatsHere = "Potion", north = 0x0, south = 0x5555557778a0, east = 0x0,
  west = 0x0}

 // END OF NORMAL MAZE




// TWISTY MAZE
 Breakpoint 1, main () at ExploreTheTwistyLabyrinth.cpp:20
 20      if (isPathToFreedom(start, kPathOutOfTwistyMaze)) {
 (gdb) i locals
 m = {_vptr.Maze = 0x555555764bf0 <vtable for Maze+16>, grid = {
     _vptr.Grid = 0x555555764c10 <vtable for Grid<MazeCell*>+16>, NumRows = 4,
     Rows = 0x555555777f10}, numRows = 4, numCols = 4, kNumTwistyRooms = 12}
 start = 0x555555778b70
 (gdb) p *start
 $1 = {whatsHere = "", north = 0x555555778ed0, south = 0x555555778cb0,
   east = 0x555555778d50, west = 0x555555778f20}
 (gdb) p *(start->east)
 $2 = {whatsHere = "", north = 0x555555778df0, south = 0x555555778b70, east = 0x555555778b20, west = 0x0}
 (gdb) p *(start->east->east)
 $3 = {whatsHere = "", north = 0x555555778d50, south = 0x0, east = 0x555555778bc0, west = 0x555555778df0}
 (gdb) p *(start->east->east->east
 A syntax error in expression, near `'.
 (gdb) p *(start->east->east->east)
 $4 = {whatsHere = "Spellbook", north = 0x0, south = 0x0, east = 0x555555778b20, west = 0x0}
 (gdb) p *(start->east->east->east->east)
 $5 = {whatsHere = "", north = 0x555555778d50, south = 0x0, east = 0x555555778bc0, west = 0x555555778df0}
 (gdb) p *(start->east->east->north)
 $6 = {whatsHere = "", north = 0x555555778df0, south = 0x555555778b70, east = 0x555555778b20, west = 0x0}
 (gdb) p *(start->east->north)
 $7 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555778b20, west = 0x555555778d50}
 (gdb) p *(start->east->south)
 $8 = {whatsHere = "", north = 0x555555778ed0, south = 0x555555778cb0, east = 0x555555778d50,
   west = 0x555555778f20}
 (gdb) p *(start->north)
 $9 = {whatsHere = "", north = 0x555555778b70, south = 0x555555778cb0, east = 0x0, west = 0x555555778d00}
 (gdb) p *(start->north->west)
 $10 = {whatsHere = "Potion", north = 0x0, south = 0x555555778ed0, east = 0x0, west = 0x555555778c10}
 (gdb) p *(start->north->west->west)
 $11 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *(start->west)
 $12 = {whatsHere = "", north = 0x555555778c10, south = 0x0, east = 0x0, west = 0x555555778b70}
 (gdb) p *(start->west->north)
 $13 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *(start->south)
 $14 = {whatsHere = "", north = 0x0, south = 0x555555778b70, east = 0x555555778c10, west = 0x555555778ed0}
 (gdb) p *(start->south->west)
 $15 = {whatsHere = "", north = 0x555555778b70, south = 0x555555778cb0, east = 0x0, west = 0x555555778d00}
 (gdb) p *(start->south->south)
 $16 = {whatsHere = "", north = 0x555555778ed0, south = 0x555555778cb0, east = 0x555555778d50,
   west = 0x555555778f20}
 (gdb) p *(start->south->east)
 $17 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *(start->north->north)
 $18 = {whatsHere = "", north = 0x555555778ed0, south = 0x555555778cb0, east = 0x555555778d50,
   west = 0x555555778f20}
 (gdb) p *(start->north->north->north)
 $19 = {whatsHere = "", north = 0x555555778b70, south = 0x555555778cb0, east = 0x0, west = 0x555555778d00}
 (gdb) p *(start->north->north->north->west)
 $20 = {whatsHere = "Potion", north = 0x0, south = 0x555555778ed0, east = 0x0, west = 0x555555778c10}
 (gdb) p *(start->north->north->north->west->north)
 Cannot access memory at address 0x0
 (gdb) p *(start->north->north->north->west->west)
 $21 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *(start->south)
 $22 = {whatsHere = "", north = 0x0, south = 0x555555778b70, east = 0x555555778c10, west = 0x555555778ed0}
 (gdb) p *(start->west)
 $23 = {whatsHere = "", north = 0x555555778c10, south = 0x0, east = 0x0, west = 0x555555778b70}
 (gdb) p *(start->west->west)
 $24 = {whatsHere = "", north = 0x555555778ed0, south = 0x555555778cb0, east = 0x555555778d50,
   west = 0x555555778f20}
 (gdb) p *(start->south->east)
 $25 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *(start->south->east->east)
 $26 = {whatsHere = "Potion", north = 0x0, south = 0x555555778ed0, east = 0x0, west = 0x555555778c10}
 (gdb) p *(start->south->east->east->south)
 $27 = {whatsHere = "", north = 0x555555778b70, south = 0x555555778cb0, east = 0x0, west = 0x555555778d00}
 (gdb) p *(start->south->east->east->west)
 $28 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *start
 $29 = {whatsHere = "", north = 0x555555778ed0, south = 0x555555778cb0, east = 0x555555778d50,
   west = 0x555555778f20}
 (gdb) i locals
 m = {_vptr.Maze = 0x555555764bf0 <vtable for Maze+16>, grid = {
     _vptr.Grid = 0x555555764c10 <vtable for Grid<MazeCell*>+16>, NumRows = 4, Rows = 0x555555777f10},
   numRows = 4, numCols = 4, kNumTwistyRooms = 12}
 start = 0x555555778b70
 (gdb) p *(start->north)
 $30 = {whatsHere = "", north = 0x555555778b70, south = 0x555555778cb0, east = 0x0, west = 0x555555778d00}
 (gdb) p *(start->north->west)
 $31 = {whatsHere = "Potion", north = 0x0, south = 0x555555778ed0, east = 0x0, west = 0x555555778c10}
 (gdb) p *(start->north->west->south)
 $32 = {whatsHere = "", north = 0x555555778b70, south = 0x555555778cb0, east = 0x0, west = 0x555555778d00}
 (gdb) p *(start->north->west->west)
 $33 = {whatsHere = "", north = 0x555555778f20, south = 0x555555778cb0, east = 0x555555778d00,
   west = 0x555555778c60}
 (gdb) p *(start->north->west->west->west)
 $34 = {whatsHere = "", north = 0x0, south = 0x555555778da0, east = 0x555555778c10, west = 0x0}
 (gdb) p *(start->north->west->west->west->south)
 $35 = {whatsHere = "Wand", north = 0x555555778c60, south = 0x0, east = 0x0, west = 0x0}
 (gdb) p *(start->east)
 $36 = {whatsHere = "", north = 0x555555778df0, south = 0x555555778b70, east = 0x555555778b20, west = 0x0}
 (gdb) p *(start->east->east)
 $37 = {whatsHere = "", north = 0x555555778d50, south = 0x0, east = 0x555555778bc0, west = 0x555555778df0}
 (gdb) p *(start->east->east->east)
 $38 = {whatsHere = "Spellbook", north = 0x0, south = 0x0, east = 0x555555778b20, west = 0x0}
 (gdb) p *(start->east->east->east->east)
 $39 = {whatsHere = "", north = 0x555555778d50, south = 0x0, east = 0x555555778bc0, west = 0x555555778df0}
 (gdb) p *(start->east->east->east->east->west)
 $40 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x555555778b20, west = 0x555555778d50}

// END OF TWISTY MAZE